In [194]:
import pandas as pd

In [195]:
url = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'

In [196]:
dados_alunos = pd.read_csv(url)

In [197]:
dados_alunos.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [198]:
dados_alunos.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [199]:
dados_alunos.shape

(18, 4)

In [200]:
dados_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 578.0+ bytes

In [201]:
dados_alunos['Nome']

0           Ary
1           Ana
2         Cátia
3         Denis
4          Beto
5         Bruna
6          Dara
7        Carlos
8         Alice
9         Vitor
10       Daniel
11         Igor
12    Sthefanie
13        Mirla
14        Paulo
15       Mylena
16        Lucas
17        Nadia
Name: Nome, dtype: object

In [202]:
dados_alunos['Idade']

0     20
1     18
2     27
3     18
4     21
5     23
6     21
7     19
8     35
9     28
10    21
11    24
12    26
13    25
14    37
15    29
16    33
17    34
Name: Idade, dtype: int64

In [203]:
dados_alunos['Notas']

0      7.5
1      NaN
2      2.5
3      5.0
4     10.0
5      NaN
6      7.0
7      6.0
8      5.6
9      NaN
10     NaN
11     4.5
12     9.5
13     9.0
14     NaN
15     7.0
16     NaN
17     8.0
Name: Notas, dtype: float64

In [204]:
dados_alunos['Aprovado']

0      True
1     False
2     False
3     False
4      True
5     False
6      True
7      True
8     False
9     False
10    False
11    False
12     True
13     True
14    False
15     True
16    False
17     True
Name: Aprovado, dtype: bool

In [205]:
dados_alunos.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

In [206]:
dados_alunos.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [207]:
dados_alunos = dados_alunos.fillna(0)

In [208]:
alunos_inex = ['Alice', 'Carlos']

In [209]:
dados_alunos_novos = dados_alunos.query('@alunos_inex not in Nome')

In [210]:
dados_alunos_novos

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    0.0     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    0.0     False
6        Dara     21    7.0      True
9       Vitor     28    0.0     False
10     Daniel     21    0.0     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    0.0     False
15     Mylena     29    7.0      True
16      Lucas     33    0.0     False
17      Nadia     34    8.0      True

In [211]:
dados_alunos_aprovados = dados_alunos_novos.query('Notas >= 7')

In [212]:
dados_alunos_aprovados = dados_alunos_aprovados.replace(7.0, 8.0)

In [215]:
dados_alunos_aprovados.to_csv('alunos_aprovados.csv', index=False, sep=';')

In [216]:
pd.read_csv('alunos_aprovados.csv', sep=';')

        Nome  Idade  Notas  Aprovado
0        Ary     20    7.5      True
1       Beto     21   10.0      True
2       Dara     21    8.0      True
3  Sthefanie     26    9.5      True
4      Mirla     25    9.0      True
5     Mylena     29    8.0      True
6      Nadia     34    8.0      True

In [218]:
dados_alunos_novos['PontoExtra'] = dados_alunos_novos['Notas'].apply(lambda x: x*0.4)

/tmp/ipykernel_6214/2166706839.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dados_alunos_novos['PontoExtra'] = dados_alunos_novos['Notas'].apply(lambda x: x*0.4)

In [219]:
dados_alunos_novos

         Nome  Idade  Notas  Aprovado  PontoExtra
0         Ary     20    7.5      True         3.0
1         Ana     18    0.0     False         0.0
2       Cátia     27    2.5     False         1.0
3       Denis     18    5.0     False         2.0
4        Beto     21   10.0      True         4.0
5       Bruna     23    0.0     False         0.0
6        Dara     21    7.0      True         2.8
9       Vitor     28    0.0     False         0.0
10     Daniel     21    0.0     False         0.0
11       Igor     24    4.5     False         1.8
12  Sthefanie     26    9.5      True         3.8
13      Mirla     25    9.0      True         3.6
14      Paulo     37    0.0     False         0.0
15     Mylena     29    7.0      True         2.8
16      Lucas     33    0.0     False         0.0
17      Nadia     34    8.0      True         3.2

In [220]:
dados_alunos_novos['NotasFinais'] = dados_alunos_novos['Notas']+dados_alunos_novos['PontoExtra']

/tmp/ipykernel_6214/3478884631.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dados_alunos_novos['NotasFinais'] = dados_alunos_novos['Notas']+dados_alunos_novos['PontoExtra']

In [236]:
dados_alunos_novos['AprovadoFinal'] = dados_alunos_novos['NotasFinais'].apply(lambda x: True if x >= 6 else False)

/tmp/ipykernel_6214/2185504069.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dados_alunos_novos['AprovadoFinal'] = dados_alunos_novos['NotasFinais'].apply(lambda x: True if x >= 6 else False)

In [238]:
dados_alunos_novos.query('Aprovado == False & AprovadoFinal == True')

     Nome  Idade  Notas  Aprovado  PontoExtra  NotasFinais  AprovadoFinal
3   Denis     18    5.0     False         2.0          7.0           True
11   Igor     24    4.5     False         1.8          6.3           True